package com.company;

//5. Написать программу, которая выводит на экран каждое 3-е i-ое значение цикла.
public class Task5 {
    public static void main(String[] args) {
        for (int i = 0; i < 100; i+=3) {
            System.out.println(i);
        }
    }
}
